# RebarHandleNameData Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RebarHandleNameData Methods
RebarHandleNameData Class See Also
---
The RebarHandleNameData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetCustomHandleTag | Gets the handle tag for which we need to specify the name. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| SetCustomHandleName | Sets the name of the handle. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
RebarHandleNameData Class
Autodesk.Revit.DB.Structure Namespace